app/controllers/calendars_controller.rb

INSERT INTO `plans` (`plan`, `date`, `created_at`, `updated_at`) VALUES ('test', '2020-10-06', '2020-10-05 09:44:14.991482', '2020-10-05 09:44:14.991482')
---
  def create
    Plan.create(plan_params)

SELECT `plans`.* FROM `plans` WHERE `plans`.`date` BETWEEN '2020-10-05' AND '2020-10-11'
---
  def getWeek
    wdays = ['(日)','(月)','(火)','(水)','(木)','(金)','(土)']

    # Dateオブジェクトは、日付を保持しています。下記のように`.today.day`とすると、今日の日付を取得できます。
    @todays_date = Date.today
    # 例)　今日が2月1日の場合・・・ Date.today.day => 1日

    @week_days = []

    plans = Plan.where(date: @todays_date..@todays_date + 6)

    7.times do |x|
      today_plans = []
      plan = plans.map do |plan|